label scane_1:
    play ambient "01_sous_la_couette_online_audio.ogg" volume 0.2
    show screen authority_screen
    

    n "30ХХ год. Мир был столь ненормален, что просто не мог вернуться на круги своя. Человечество стало расходным материалом, а улицы заполонили демоны."

    n "Ранговая система. Ангельский компьютер. Боль и слёзы. Демонический мир вторгся на Землю и подчинил её себе. История не должна начинаться столь абстрактно, но…"
    nvl clear
    show black with fade

    scene bg fon_pereulok_mesto_prestplenia_1 with dissolve
    show rain with dissolve

    play music "city_street_mkiyhqnu.ogg"

    "???" "Моя история – исключение из правил. "
    show thunder
    "???" "Уже несколько сотен лет прошло с тех пор, как нас захватили демоны. Люди, словно скот, делятся на сорта. Чем выше ранг, тем проще жить."
    "???" "Особо талантливые даже удостаиваются чести получить демоническую силу."
    "???" "Ангельский компьютер определяет ценность человека. Люди высшие работают и живут бок о бок с демонами в комфорте и достатке."
    "???" "Средний класс почти не изменил своего скучного быта, разве что обязан работать исправно, иначе недалеко и до изгнания в трущобы."
    "???" "Те, кого считают скотом, лишь рабы демонов – их игрушки. Наступают войны? Вот вам пушечное мясо. Захотелось развлечься? Вот вам бесплатные проститутки."
    "???" "Всё это лишь игра, но выиграть в ней невозможно. Поэтому я решил не играть."
    '''
    Юноша медленно шёл по узкому переулку, осветляя мрак ночи белоснежным
    дымом, что так нежно выпускал изо рта.

    Поблёскивание сигареты выдавало его и без
    того не скрытое присутствие.

    чуть больше двадцати лет он живёт в этом мире. С самого рождения видит
    увядание человечества, от чего часто задаётся вопросом – а зачем тогда жить?

    Пройдя до яркого квартала, парень бросил окурок под ноги и несколько лениво
    втоптал пепел в асфальт. В кармане навязчиво завибрировал телефон.
    '''


    "???" "Я почти в офисе, что тебе?"
    "Голос" "«У нас проблемы, срочно прихо…»"
    "???" "Что случилось?"

    "Гудки бесцеремонно прервали разговор. Попытки перезвонить остались без результатными."
    "Натянув капюшон, парень быстрым шагом направился на работу. "

    show black with dissolve
    hide rain
    scene black with dissolve
    stop music
    jump scane_2
